In [1]:
import pandas as pd

In [2]:
data = [[1,2,3], [4, 5, 6], [7, 8, 9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [3]:
list('321')

['3', '2', '1']

In [4]:
df = pd.DataFrame(data, list('321'), list('zyx'))
df

   z  y  x
3  1  2  3
2  4  5  6
1  7  8  9

In [5]:
df.sort_index(inplace = True)
df

   z  y  x
1  7  8  9
2  4  5  6
3  1  2  3

In [6]:
df.sort_index(inplace = True, axis = 1)
df

   x  y  z
1  9  8  7
2  6  5  4
3  3  2  1

In [7]:
df.sort_values(by = 'x', inplace = True)
df

   x  y  z
3  3  2  1
2  6  5  4
1  9  8  7

In [8]:
df.sort_values(by = '3', axis = 1,inplace = True)
df

   z  y  x
3  1  2  3
2  4  5  6
1  7  8  9

In [9]:
df.sort_values(by = ['1', '3'], axis = 1,inplace = True)
df

   z  y  x
3  1  2  3
2  4  5  6
1  7  8  9

In [10]:
df_A = [['Ary', 'M', 21], ['Cátia', 'F', 19], ['Carlos', 'M', 50], ['Beto', 'M', 29], ['Bruna', 'F', 31], ['Ana', 'F', 42]]
df_A

[['Ary', 'M', 21],
 ['Cátia', 'F', 19],
 ['Carlos', 'M', 50],
 ['Beto', 'M', 29],
 ['Bruna', 'F', 31],
 ['Ana', 'F', 42]]

In [11]:
df_A = pd.DataFrame(data = df_A, columns = ['Nome', 'Sexo', 'Idade'])
df_A

     Nome Sexo  Idade
0     Ary    M     21
1   Cátia    F     19
2  Carlos    M     50
3    Beto    M     29
4   Bruna    F     31
5     Ana    F     42

In [12]:
df_B = df_A.sort_values(by = ['Sexo', 'Nome'])
df_B

     Nome Sexo  Idade
5     Ana    F     42
4   Bruna    F     31
1   Cátia    F     19
0     Ary    M     21
3    Beto    M     29
2  Carlos    M     50

In [13]:
df_B = df_A.sort_values(by = ['Nome', 'Sexo'])
df_B

     Nome Sexo  Idade
5     Ana    F     42
0     Ary    M     21
3    Beto    M     29
4   Bruna    F     31
2  Carlos    M     50
1   Cátia    F     19